{"cards":[{"name":"Emrakul, the Aeons Torn","manaCost":"{15}","cmc":15,"type":"Legendary Creature — Eldrazi","supertypes":["Legendary"],"types":["Creature"],"subtypes":["Eldrazi"],"rarity":"Mythic Rare","set":"MM2","setName":"Modern Masters 2015 Edition","text":"This spell can't be countered.\nWhen you cast this spell, take an extra turn after this one.\nFlying, protection from colored spells, annihilator 6\nWhen Emrakul, the Aeons Torn is put into a graveyard from anywhere, its owner shuffles their graveyard into their library.","artist":"Mark Tedin","number":"3","power":"15","toughness":"15","layout":"normal","multiverseid":397905,"imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=397905&type=card","rulings":[{"date":"2010-06-15","text":"Annihilator abilities trigger and resolve during the declare attackers step. The defending player chooses and sacrifices the required number of permanents before they declare blockers. Any creatures sacrificed this way won't be able to block."},{"date":"2010-06-15","text":"If a creature with annihilator is attacking a planeswalker, and the defending player chooses to sacrifice that planeswalker, the attacking creature continues to attack. It may be blocked. If it isn't blocked, it simply won't deal combat damage to anything."},{"date":"2010-06-15","text":"Emrakul can be targeted by spells that try to counter it (such as Lay Bare). Those spells will resolve, but the part of their effect that would counter Emrakul won't do anything. Any other effects those spells have will work as normal."},{"date":"2010-06-15","text":"\"Protection from colored spells\" means that Emrakul can't be the target of colored spells (including colored Aura spells) or of abilities whose sources are colored spells (such as the \"when you cast\" ability of an Ulamog, the Infinite Gyre that's been turned red by Painter's Servant). It also means that all damage that would be dealt to Emrakul by colored spells is prevented. Like every protection ability, it works only while Emrakul is on the battlefield."},{"date":"2010-06-15","text":"\"Colored spells\" is not synonymous with \"colored instants and sorceries.\" For example, if a player cycles Choking Tethers, its triggered ability may target Emrakul because Choking Tethers wasn't cast as a spell."},{"date":"2010-06-15","text":"Emrakul may be affected by colored spells that don't target it or deal damage to it, including those that cause it to become blocked. Abilities of colored permanents (such as Journey to Nowhere) may target it. Auras may be moved onto it by abilities or by colored spells that don't target it (such as Aura Graft)."}],"foreignNames":[{"name":"万世创伤伊莫库","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=398154&type=card","language":"Chinese Simplified","multiverseid":398154},{"name":"引き裂かれし永劫、エムラクール","imageUrl":"http://gatherer.wizards.com/Handlers/Image.ashx?multiverseid=398403&type=card","language":"Japanese","multiverseid":398403}],"printings":["pPRE","ROE","MM2"],"originalText":"Emrakul, the Aeons Torn can't be countered.\nWhen you cast Emrakul, take an extra turn after this one.\nFlying, protection from colored spells, annihilator 6\nWhen Emrakul is put into a graveyard from anywhere, its owner shuffles his or her graveyard into his or her library.","originalType":"Legendary Creature — Eldrazi","legalities":[{"format":"Commander","legality":"Banned"},{"format":"Legacy","legality":"Legal"},{"format":"Modern","legality":"Legal"},{"format":"Vintage","legality":"Legal"}],"id":"8d8ea93bf3ac0c23b7789088b16ce21b0637d05c"}]}